Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱི་ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of physical actions in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་ལུས་ཀྱི་ལས་ཡོངས་སུ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱི་ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as knowledge of physical actions within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the path that leads to cessation as related to knowledge of physical actions to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ངག་གི་ལས་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, the Thus-Gone One correctly understands the knowledge of verbal actions in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་བརྫུན་དུ་སྨྲ་བའམ། བརྫུན་དུ་སྨྲ་བ་ལས་ལྡོག་པའམ། ཕྲ་མའི་ངག་གམ། ཕྲ་མའི་ངག་ལས་ལྡོག་པའམ། ཚིག་རྩུབ་པོའི་ངག་གམ། ཚིག་རྩུབ་པོའི་ངག་ལས་ལྡོག་པའམ། ཚིག་ཀྱལ་པའམ་ཚིག་ཀྱལ་པ་ལས་ལྡོག་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ།
en: For example, just as lies or truth, divisive talk or harmonious statements, harsh speech or gentle words, and idle gossip or meaningful presentations within the dream of an illusory person are merely conventions,

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ངག་གི་ལས་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: just so the Thus-Gone One correctly understands the entire knowledge of verbal actions to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ངག་གི་ལས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of verbal actions in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་ཚད་མས་བསྟན་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ངག་གི་ལས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the perception of a teaching that is authentically delivered within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of verbal actions to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ངག་གི་ལས་ཤེས་པ་འགོག་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of verbal actions in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་ངག་གི་ལས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ངག་གི་ལས་ཤེས་པ་འགོག་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as knowledge of cessation as related to knowledge of verbal actions within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of verbal actions to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ངག་གི་ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of verbal actions in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་ཟོས་པ་དང་། མ་ཟོས་པ་ཡོངས་སུ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ངག་གི་ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the comprehension of what has been enjoyed and what has not been enjoyed within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the path that leads to cessation as related to knowledge of verbal actions to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཡིད་ཀྱི་ལས་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, the Thus-Gone One correctly understands the knowledge of mental actions in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་བར་སྣང་ལ་རི་མོ་འདྲི་བ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཡིད་ཀྱི་ལས་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as a drawing in the sky within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of mental actions to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཡིད་ཀྱི་ལས་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of mental actions in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་རི་མོ་འདྲི་བའི་བཟོ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ།
en: For example, just as the knowledge of the art of drawing within the dream of an illusory person is merely a convention,

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཡིད་ཀྱི་ལས་ཤེས་པ་འགོག་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of mental actions in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་རི་མོ་འདྲི་བའི་བསྐལ་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ།
en: For example, just as knowledge of the disappearance of a drawing within the dream of an illusory person is merely a convention,

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཡིད་ཀྱི་ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ
en: Householder, the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of mental actions in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་སློབ་དཔོན་གྱིས་བསྟན་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཡིད་ཀྱི་ལས་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ།། །།
en: For example, just as an instructor teaching within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the path that leads to cessation as related to knowledge of mental actions to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་སྔོན་དུ་འགྲོ་བ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, the Thus-Gone One correctly understands the knowledge of the preceding in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་སྔོན་དུ་མགྱོགས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་སྔོན་དུ་འགྲོ་བ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as what has just happened within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the preceding to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་སྔོན་དུ་འགྲོ་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the preceding in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་ཕྱོགས་དག་ཏུ་དོན་གྱིས་བསམ་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་སྔོན་དུ་འགྲོ་བ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the contemplation of past events within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the preceding to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་སྔོན་དུ་འགྲོ་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the preceding in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་སྔོན་དུ་མགྱོགས་པ་ཤི་བ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་སྔོན་དུ་འགྲོ་བ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as a prior death within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the preceding to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་སྔོན་དུ་འགྲོ་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the preceding in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་ཕྱོགས་དག་ཏུ་དོན་གྲུབ་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་སྔོན་དུ་འགྲོ་བ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the perception of a previous accomplishment within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the path that leads to cessation as related to knowledge of the preceding to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་རྗེས་སུ་འཇུག་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, the Thus-Gone One correctly understands the knowledge of the subsequent in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་རྣམ་པར་སད་པ་བྱེད་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་རྗེས་སུ་འཇུག་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the perception of someone being awoken within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the subsequent to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་རྗེས་སུ་འཇུག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the subsequent in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་རྣམ་པར་སད་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་རྗེས་སུ་འཇུག་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the perception of awakening within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the subsequent to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་རྗེས་སུ་འཇུག་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the subsequent in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་མ་ཤི་བ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་རྗེས་སུ་འཇུག་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as a survivor within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the subsequent to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་རྗེས་སུ་འཇུག་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the subsequent in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་མི་འཐུན་པའི་རྩ་བ་ཡང་དག་པར་གཅོད་པ་ནི་མིང་ཙམ་སྟེ།
en: For example, just as the severance of discordant roots within the dream of an illusory person is merely a convention,

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་མི་ཉམས་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, the Thus-Gone One correctly understands the knowledge of the lack of decay in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་དུག་འཐུངས་པའི་རྩི་སྨན་མ་ལུས་པར་བྱེད་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་མི་ཉམས་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the complete concoction of an elixir to counter the ingestion of poison within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the lack of decay to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་མི་ཉམས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the lack of decay in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་དུག་བྱིན་པ་ལ་དུག་བསལ་བ་ཚོལ་བ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་མི་ཉམས་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the attempt to neutralize the toxins in someone who has been poisoned within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the lack of decay to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་མི་ཉམས་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the lack of decay in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་དུག་ཡང་མི་འབྱུང་བ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་མི་ཉམས་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the nonoccurrence of poison within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the lack of decay to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་མི་ཉམས་པ་ཤེས་པ་འགོག་པ་ཤེས་པར་འགྱུར་བའི་ལམ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the lack of decay in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་དུག་བྱིན་པ་ལ་ཡང་དག་པའི་གསོ་བའི་དཔྱད་བྱེད་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཡོངས་སུ་མི་ཉམས་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as a diagnosis of the proper cure for someone who has been poisoned within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the path that leads to cessation as related to knowledge of the lack of decay to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: “Householder, the Thus-Gone One correctly understands the knowledge of omniscience in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་རྩི་སྨན་མཁན་ནད་ལ་མཁས་པ་དང་། ནད་ཀུན་ནས་ལྡང་བ་ལ་མཁས་པ་དང་། ནད་པའི་ཁམས་ལ་མཁས་པ་དང་། སྨན་སྦྱོར་བ་ལ་མཁས་པ་དང་། ཁ་ཟས་ཀྱི་ཆོ་ག་ལ་མཁས་པ་དང་། ཁྲུས་ཀྱི་ཆོ་ག་ལ་མཁས་པ་དང་། བསྐུ་མཉེའི་ཆོ་ག་ལ་མཁས་པ་དང་། རྐང་པས་མཉེ་བའི་ཆོ་ག་ལ་མཁས་པ་དང་། ལག་པས་མཉེ་བའི་ཆོ་ག་ལ་མཁས་པ་དང་། ཉལ་བའི་ཆོ་ག་ལ་མཁས་པ་དང་། སད་པའི་ཆོ་ག་ལ་མཁས་པ་དང་། ལོངས་སྤྱོད་ཀུན་གྱི་ཆོ་ག་ལ་མཁས་པ་དང་། དཔྱད་ཀྱི་སྦྱོར་བ་འཇུག་པ་ལ་མཁས་པ་དང་། དུས་ཤེས། ཚོད་ཤེས། དུས་མིན་ཤེས་ཤིང་སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་རྩི་སྨན་དག་གིས་ནད་ཐམས་ཅད་འཇོམས་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ།
en: For example, just as a specialist in the production of elixirs, who is learned regarding diseases, the manifestation of diseases, the elements of the patient, and the application of medicines, as well as the way to maintain proper diet, bathing, massage, foot massage, hand massage, sleep, rising, and general activity, in addition to having the skills of diagnosis, timeliness, proper measurement, and the ability to overcome any disease by means of elixirs within the dream of an illusory person is merely a convention,

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: just so the Thus-Gone One correctly understands the entire knowledge of omniscience to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of omniscience in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་སྤྲུལ་པའི་གསོ་བའི་དཔྱད་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the knowledge of an emanated being who diagnoses the proper cure within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of omniscience to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of omniscience in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as the knowledge of curing all diseases within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of omniscience to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་འདི་ལྟར་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of omniscience in the following way.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་སྐྱེས་བུའི་རྨི་ལམ་ན་གསོ་བའི་དཔྱད་ཇི་སྙེད་པ་ཉིད་ནི་མིང་ཙམ་སྟེ། དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཐམས་ཅད་མཁྱེན་པ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཇི་སྙེད་པ་ཉིད་ཀྱང་མིང་ཙམ་དུ་དེ་ལྟར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: For example, just as a diagnosis of the proper cure within the dream of an illusory person is merely a convention, just so the Thus-Gone One correctly understands the entire knowledge of the path that leads to cessation as related to knowledge of omniscience to be a mere convention.

source: ཁྱིམ་བདག་དེ་ལྟ་བས་ན་འདིར་གང་གི་ཡེ་ཤེས་མཐོང་བ་ཐོགས་པ་མེད་པར་འཇུག་པ་གཞན་གྱིས་མ་བསྟན་ཅིང་། གཞན་ལ་རག་མ་ལས་པའི་ཤེས་པས་སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པའི་དོན་དུ་བདག་ཉིད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་
en: “Householder, this unimpeded wisdom vision is not taught by others and this knowledge does not depend on others. Through that he has attained perfect buddhahood in order to benefit sentient beings.

source: ཁྱིམ་བདག་ཕྱྭ་མཁན་གྱིས་ལག་གི་བླ་ཚེ་དང་ལྡན་པ་གང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The householder master builder then asked the superintendent, venerable Pūrṇa,

source: གང་པོ་བཅོམ་ལྡན་འདས་དེ་ད་ལྟར་གང་ན་བཞུགས།
en: “Pūrṇa, where is the Blessed One residing at present?”

source: ལག་གི་བླ་གང་པོས་ཁྱིམ་བདག་ཕྱྭ་མཁན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The superintendent, venerable Pūrṇa, replied to the householder master builder,

source: ཁྱིམ་བདག་བྱང་ཕྱོགས་ལོགས་ན་ཀོ་ས་ལ་ཞེས་བྱ་བའི་ཡུལ་གྱི་ལྗོངས་ཡོད་དེ།
en: “Householder, to the north of here is the country of Kośala, within which,

source: གངས་རིའི་རྒྱལ་པོའི་དྲུང་ན་མཉན་ཡོད་ཅེས་བྱ་བ་གྲོང་ཁྱེར་ཆེན་པོ་དེ་ན་རྒྱལ་པོའི་བུ་གཞོན་ནུ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། བཅོམ་ལྡན་འདས་དེ་ད་ལྟར་བཞུགས་སོ། །
en: at the base of the majestic snow mountains, lies the city of Śrāvastī. There one finds the householder Anāthapiṇḍada’s park, a grove that formerly belonged to Prince Jeta, the son of the King of Kośala. That is where the Blessed One resides.”

source: གང་པོ་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་འདི་ནས་རིང་ཁྱད་ཅི་ཙམ་སྨྲས་པ།
en: “Pūrṇa, how far from here is the city of Śrāvastī?”

source: ཁྱིམ་བདག་དེ་དཔག་ཚད་སུམ་སྟོང་དྲུག་ཅུ་རྩ་བཞི་ཡོད་དོ། །
en: “Householder, it is three thousand sixty-four leagues away.”

source: གང་པོ་རིང་བ་དེ་ནས་བཅོམ་ལྡན་འདས་དེ་ཇི་སྲིད་ཅིག་གིས་འདིར་བྱོན་སྨྲས་པ།
en: “Pūrṇa, from so far away, how could the Blessed One ever possibly come here?”

source: ཁྱིམ་བདག་དེ་བཞིན་གཤེགས་པ་ལ་ནི་རིང་བའམ་ཉེ་བ་མེད་དེ།
en: “Householder, for the Thus-Gone One there is no near or far.

source: ཁྱིམ་བདག་བཅོམ་ལྡན་འདས་དེ་བཞེད་ན།
en: Householder, if the Blessed One so wishes,

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་གྲངས་མེད་པའི་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལས་ལྷག་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཁྲག་ཁྲིག་དག་ཏུ་གཤེགས་སོ། །
en: he can journey to billions of universes, more numerous than the grains of sand in uncountable Ganges rivers, in order to ripen sentient beings.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་དག་མཁྱེན།
en: Householder, the Thus-Gone One knows the thoughts and actions of all beings there.

source: ཤིན་ཏུ་མཁྱེན།
en: He knows them accurately,

source: ཤིན་ཏུ་གཟིགས།
en: he sees them,

source: ཤིན་ཏུ་ཐུགས་སུ་ཆུད།
en: he understands them,

source: ཤིན་ཏུ་མངོན་སུམ་དུ་མཛད་དེ།
en: they appear directly to him.

source: མིག་བཙུམས་པ་ཙམ་གྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་དག་རབ་ཏུ་མཁྱེན་ཏོ། །
en: In the blink of an eye he knows the thoughts and actions of all beings.

source: ཁྱིམ་བདག་དེ་བཞིན་གཤེགས་པས་དེ་བཞེད་ན་
en: Householder, if the Thus-Gone One so wishes,

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་གདགས་པའི་བློ་ཉེ་བར་བཞག་ནས།
en: with the mindset of benefiting all beings.”

source: འཇིག་རྟེན་གྱི་ཁམས་ཁྲག་ཁྲིག་དག་ཏུ་གཤེགས་སོ། །
en: he can journey to billions of realms

source: གང་པོ་བདག་གི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་ཞལ་ཟས་བཟང་པོ་ལ་ཉེ་བར་སྤྱན་དྲངས་ན་གཤེགས་སམ།
en: “Pūrṇa, if I were to invite him to a fine meal in order to acquire roots of virtue, would the Thus-Gone One come here?”

source: ཁྱིམ་བདག་གལ་ཏེ་ཅུང་ཟད་ཡོངས་སུ་གཏོང་བ་ལྟ་ན་དེ་བཞིན་གཤེགས་པ་དེ་ཞལ་ཟས་གཙང་མ་ལ་སྤྱན་དྲོངས་ཤིག་དང་།
en: “Householder, even if one is just giving a little, one should still invite the Thus-Gone One to a fresh meal.

source: ཁྱོད་ཀྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་བཅོམ་ལྡན་འདས་དེ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པར་གཤེགས་སོ། །
en: In order to embrace your roots of virtue, the Blessed One will come here together with his congregation of hearers.”

source: དེ་ནས་ཁྱིམ་བདག་ཕྱྭ་མཁན་གྱིས་ཚེ་དང་ལྡན་པ་གང་པོའི་ལྟར་མཉན་ནས།
en: So the householder master builder, doing what venerable Pūrṇa had advised,

source: མེ་ཏོག་དང་། ཕྲེང་བ་དང་། བདུག་པ་དག་བླངས་ཏེ།
en: fetched flowers, flower garlands, and incense.

source: ཙན་དན་གྱི་ཁྱམས་དང་། ཁང་སྟེང་དུ་འཛེགས་ནས་མེ་ཏོག་གིས་བརྒྱན། སྤོས་ཀྱིས་བྱུགས་ནས།
en: In the sandalwood courtyard and the roof of the temple he placed flower decorations and sprinkled perfume.

source: བཅོམ་ལྡན་འདས་དེ་ཕྱོགས་གང་ལོགས་ན་བཞུགས་པ་དེར་ཕྱོགས་ནས་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ།
en: He then faced in the direction where the Blessed One was dwelling, draped his shawl over one shoulder,

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་
en: placed his right knee on the ground, and,

source: ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: with palms joined, he said,

source: བཅོམ་ལྡན་འདས་བདག་ལ་ཐུགས་བརྩེ་བ་ཉེ་བར་དགོངས་ཏེ།
en: “Blessed One, please consider me with compassion!
